taskmannager/app/controllers/tasks_controller.rb

    task = Task.create(attributes)
---
INSERT INTO "tasks" ("name", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Kick Arthur'ass: Arthur, I'm your father"], ["status", "t"], ["created_at", "2016-03-22 16:29:17.773949"], ["updated_at", "2016-03-22 16:29:17.773949"]]

    task = Task.find(params[:id])
    task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "Kick Arthur's ass: ass survival"], ["updated_at", "2016-03-22 17:18:27.773247"], ["id", 1]]